Tekla.Structures.Catalogs.DrawingItem
The DrawingItem class contains information from the drawings in the master drawing catalog.

Tekla.Structures.Catalogs.DrawingItem.#ctor
Creates a new drawing item instance.

Tekla.Structures.Catalogs.DrawingItem.Name
The drawing item's name.

Tekla.Structures.Catalogs.DrawingItem.Files
The files belonging to drawing item.

Tekla.Structures.Catalogs.DrawingItem.Type
The files belonging to drawing item.

Tekla.Structures.Catalogs.DrawingItem.Select(System.String)
Selects the drawing item in the drawing catalog.
Name: The Name of the drawing item to select.
Returns: True on success.

Tekla.Structures.Catalogs.DrawingItem.Export(System.String@)
Exports the drawing item in the catalog to given file name.
If path is not given drawing is exported to model folder.
If filename is empty drawing name is used as filename.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
DrawingItem item = new DrawingItem();
if (item.Select())
{
string filename = System.IO.Path.GetTempPath() + item.Name;
if (item.Export(ref filename))
{
Console.WriteLine(item.Name + " exported successfully");
}
}
}
}
filename: The export file name of the drawing item.
Returns: True on success.